In [2]:
import pandas as pd

In [4]:
df = pd.read_csv('Data/name.basics.csv')
df.head(), df.shape

(      nconst       primary_name  birth_year  death_year  \
 0  nm0061671  Mary Ellen Bauder         NaN         NaN
 1  nm0061865       Joseph Bauer         NaN         NaN
 2  nm0062070         Bruce Baum         NaN         NaN
 3  nm0062195       Axel Baumann         NaN         NaN
 4  nm0062798        Pete Baxter         NaN         NaN

                                  primary_profession  \
 0         miscellaneous,production_manager,producer
 1        composer,music_department,sound_department
 2                        miscellaneous,actor,writer
 3  camera_department,cinematographer,art_department
 4  production_designer,art_department,set_decorator

                           known_for_titles
 0  tt0837562,tt2398241,tt0844471,tt0118553
 1  tt0896534,tt6791238,tt0287072,tt1682940
 2  tt1470654,tt0363631,tt0104030,tt0102898
 3  tt0114371,tt2004304,tt1618448,tt1224387
 4  tt0452644,tt0452692,tt3458030,tt2178256  ,
 (606648, 6))

In [6]:
df1 = pd.read_csv('Data/title.ratings.csv')
df1.head(), df1.shape

(       tconst  averagerating  numvotes
 0  tt10356526            8.3        31
 1  tt10384606            8.9       559
 2   tt1042974            6.4        20
 3   tt1043726            4.2     50352
 4   tt1060240            6.5        21,
 (73856, 3))

In [7]:
df2 = pd.read_csv('Data/tn.movie_budgets.csv')
df2.head(), df2.shape

(   id  release_date                                        movie  \
 0   1  Dec 18, 2009                                       Avatar
 1   2  May 20, 2011  Pirates of the Caribbean: On Stranger Tides
 2   3   Jun 7, 2019                                 Dark Phoenix
 3   4   May 1, 2015                      Avengers: Age of Ultron
 4   5  Dec 15, 2017            Star Wars Ep. VIII: The Last Jedi

   production_budget domestic_gross worldwide_gross
 0      $425,000,000   $760,507,625  $2,776,345,279
 1      $410,600,000   $241,063,875  $1,045,663,875
 2      $350,000,000    $42,762,350    $149,762,350
 3      $330,600,000   $459,005,868  $1,403,013,963
 4      $317,000,000   $620,181,382  $1,316,721,747  ,
 (5782, 6))

In [8]:
df3 = pd.read_csv('Data/tmdb.movies.csv', index_col= 'Unnamed: 0')
df3.head(), df3.shape

(             genre_ids     id original_language  \
 0      [12, 14, 10751]  12444                en
 1  [14, 12, 16, 10751]  10191                en
 2        [12, 28, 878]  10138                en
 3      [16, 35, 10751]    862                en
 4        [28, 878, 12]  27205                en

                                  original_title  popularity release_date  \
 0  Harry Potter and the Deathly Hallows: Part 1      33.533   2010-11-19
 1                      How to Train Your Dragon      28.734   2010-03-26
 2                                    Iron Man 2      28.515   2010-05-07
 3                                     Toy Story      28.005   1995-11-22
 4                                     Inception      27.920   2010-07-16

                                           title  vote_average  vote_count
 0  Harry Potter and the Deathly Hallows: Part 1           7.7       10788
 1                      How to Train Your Dragon           7.7        7610
 2                                    Iron Man 2           6.8       12368
 3                                     Toy Story           7.9       10174
 4                                     Inception           8.3       22186  ,
 (26517, 9))

In [9]:
df2[df2['movie'] == 'Toy Story']

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
1836,37,"Nov 22, 1995",Toy Story,"$30,000,000","$191,796,233","$364,545,516"

# There are duplicates in df3, which is tmdb.movies.csv

In [10]:
df3[df3['title']  == 'Toy Story']

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
2473,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174

In [11]:
df3.drop_duplicates(inplace=True)

In [12]:
df3.shape

(25497, 9)